In [1]:
import pandas as pd
import numpy as np
import python_functions_sp as pf
import warnings
warnings.filterwarnings("ignore")
import sqlalchemy
import psycopg2
import sql_functions_sp as sf

# Import

In [2]:
PISA_m = pd.read_excel('data/2000-2022_m_r.xls', sheet_name='mathematics', header=11)
PISA_r = pd.read_excel('data/2000-2022_m_r.xls', sheet_name='reading', header=11)
PISA_sc = pd.read_excel('data/2000-2022_sc.xls', sheet_name='science', header=11)

In [3]:
PISA_m.head()

,Unnamed: 0,Year/Study,Jurisdiction,Average,Standard Error
0,NaN,2022,Selected countries and jurisdictions,437.628559,0.266429
1,NaN,2022,International Average (OECD),472.358125,0.397751
2,NaN,2022,Australia,487.084254,1.779614
3,NaN,2022,Austria,487.267499,2.337789
4,NaN,2022,Belgium,489.486817,2.202874

In [4]:
PISA_r.head()

,Unnamed: 0,Year/Study,Jurisdiction,Average,Standard Error
0,NaN,2022,Selected countries and jurisdictions,435.037917,0.295268
1,NaN,2022,International Average (OECD),475.588873,0.452402
2,NaN,2022,Australia,498.05094,2.013591
3,NaN,2022,Austria,480.405847,2.668254
4,NaN,2022,Belgium,478.852668,2.523596

In [5]:
PISA_sc.head()

,Unnamed: 0,Year/Study,Jurisdiction,Average,Standard Error
0,NaN,2022,Selected countries and jurisdictions,446.893945,0.282993
1,NaN,2022,International Average (OECD),484.646614,0.435314
2,NaN,2022,Australia,507.000869,1.933076
3,NaN,2022,Austria,491.270959,2.650135
4,NaN,2022,Belgium,490.578346,2.481873

In [6]:
PISA_m = PISA_m.drop('Unnamed: 0', axis=1)
PISA_r = PISA_r.drop('Unnamed: 0', axis=1)
PISA_sc = PISA_sc.drop('Unnamed: 0', axis=1)

---

# Put column names in lower case, snake case and rename

In [7]:
dataframes = [PISA_m, PISA_r, PISA_sc]

pf.columns_lower_snake_case(dataframes)

Index(['year', 'jurisdiction', 'average', 'standard_error'], dtype='object')
------------------------------
Index(['year', 'jurisdiction', 'average', 'standard_error'], dtype='object')
------------------------------
Index(['year', 'jurisdiction', 'average', 'standard_error'], dtype='object')
------------------------------

,year,jurisdiction,average,standard_error
0,2022,Selected countries and jurisdictions,446.893945,0.282993
1,2022,International Average (OECD),484.646614,0.435314
2,2022,Australia,507.000869,1.933076
3,2022,Austria,491.270959,2.650135
4,2022,Belgium,490.578346,2.481873
...,...,...,...,...
785,‡ Reporting standards not met.,NaN,NaN,NaN
786,— Not available.,NaN,NaN,NaN
787,† Not applicable.,NaN,NaN,NaN
788,NOTE: B-S-J-G (China) refers to the four PISA ...,NaN,NaN,NaN
789,SOURCE: Organization for Economic Cooperation ...,NaN,NaN,NaN

In [8]:
PISA_m.sample(5)

     year         jurisdiction     average standard_error
549  2006              Georgia           —              †
636  2003               Brazil  356.015791       4.832296
725  2000        United States           —              †
482  2009  Trinidad and Tobago  414.044966       1.279861
255  2015              Georgia  403.833229       2.781939

In [9]:
PISA_r.sample(5)

     year                jurisdiction     average standard_error
221  2015                  Luxembourg  481.439097       1.441445
622  2003                       Spain  480.537991       2.601311
111  2018                      France  492.606479       2.320979
613  2003                  Luxembourg  479.422584       1.484252
191  2018  Ukraine (18 of 27 Regions)           —              †

In [10]:
PISA_sc.sample(5)

     year jurisdiction     average standard_error
375  2012         Peru  373.113448       3.575008
448  2009       Cyprus           —              †
673  2003       Russia           —              †
259  2015      Jamaica           —              †
219  2015       Latvia  490.225018       1.560282

## Change the types for two columns and round the numbers

In [11]:
dataframes = [PISA_m, PISA_r, PISA_sc]

for df in dataframes:
    df['average'] = df['average'].apply(pd.to_numeric, errors='coerce')
    df['average'] = df['average'].round(2)

    df['standard_error'] = df['standard_error'].apply(pd.to_numeric, errors='coerce')
    df['standard_error'] = df['standard_error'].round(2)

In [12]:
PISA_m.sample(5)

     year       jurisdiction  average  standard_error
159  2018  Hong Kong (China)   551.15            3.00
612  2003          Lithuania      NaN             NaN
400  2009         Costa Rica      NaN             NaN
346  2012           Bulgaria   438.74            3.99
646  2003        El Salvador      NaN             NaN

In [13]:
PISA_r.sample(5)

     year       jurisdiction  average  standard_error
159  2018  Hong Kong (China)   524.28            2.73
738  2000           Bulgaria   430.40            4.89
158  2018          Guatemala      NaN             NaN
565  2006         Montenegro   391.98            1.22
646  2003        El Salvador      NaN             NaN

In [14]:
PISA_sc.sample(5)

     year           jurisdiction  average  standard_error
374  2012               Paraguay      NaN             NaN
764  2000  Palestinian Authority      NaN             NaN
228  2015        Slovak Republic   460.77            2.59
165  2018                 Kosovo   364.88            1.17
323  2012                 Norway   494.52            3.09

---

# Exploratory Data Analysis - EDA
- understand the data
- drop unneeded columns
- duplicates
- missing values
- descriptive statistics
- extreme values / outliers

In [15]:
PISA_m.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 790 entries, 0 to 789
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            789 non-null    object
 1   jurisdiction    784 non-null    object
 2   average         457 non-null    float64
 3   standard_error  457 non-null    float64
dtypes: float64(2), object(2)
memory usage: 24.8+ KB

In [16]:
PISA_r.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 790 entries, 0 to 789
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            789 non-null    object
 1   jurisdiction    784 non-null    object
 2   average         498 non-null    float64
 3   standard_error  498 non-null    float64
dtypes: float64(2), object(2)
memory usage: 24.8+ KB

In [17]:
PISA_sc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 790 entries, 0 to 789
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   year            789 non-null    object
 1   jurisdiction    784 non-null    object
 2   average         416 non-null    float64
 3   standard_error  416 non-null    float64
dtypes: float64(2), object(2)
memory usage: 24.8+ KB

## Check for duplicates

In [18]:
PISA_m.duplicated().value_counts()

False    790
Name: count, dtype: int64

In [19]:
PISA_r.duplicated().value_counts()

False    790
Name: count, dtype: int64

In [20]:
PISA_sc.duplicated().value_counts()

False    790
Name: count, dtype: int64

## Check for missing values

In [21]:
PISA_m.isnull().sum()

year                1
jurisdiction        6
average           333
standard_error    333
dtype: int64

In [22]:
PISA_r.isnull().sum()

year                1
jurisdiction        6
average           292
standard_error    292
dtype: int64

In [23]:
PISA_sc.isnull().sum()

year                1
jurisdiction        6
average           374
standard_error    374
dtype: int64

In [24]:
PISA_m = PISA_m.tail(-2)
PISA_m = PISA_m.head(-6)

PISA_r = PISA_r.tail(-2)
PISA_r = PISA_r.head(-6)

PISA_sc = PISA_sc.tail(-2)
PISA_sc = PISA_sc.head(-6)

In [25]:
PISA_m

     year                jurisdiction  average  standard_error
2    2022                   Australia   487.08            1.78
3    2022                     Austria   487.27            2.34
4    2022                     Belgium   489.49            2.20
5    2022                      Canada   496.95            1.56
6    2022                       Chile   411.70            2.08
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

In [26]:
PISA_r

     year                jurisdiction  average  standard_error
2    2022                   Australia   498.05            2.01
3    2022                     Austria   480.41            2.67
4    2022                     Belgium   478.85            2.52
5    2022                      Canada   507.13            1.97
6    2022                       Chile   447.98            2.63
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

In [27]:
PISA_sc

     year                jurisdiction  average  standard_error
2    2022                   Australia   507.00            1.93
3    2022                     Austria   491.27            2.65
4    2022                     Belgium   490.58            2.48
5    2022                      Canada   515.02            1.93
6    2022                       Chile   443.54            2.47
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

## Do some descriptive statistics

In [28]:
PISA_m.describe()

          average  standard_error
count  455.000000      455.000000
mean   462.632330        2.613473
std     56.296721        0.989505
min    317.960000        0.290000
25%    417.355000        2.020000
50%    478.820000        2.580000
75%    502.915000        3.165000
max    591.390000        6.740000

In [29]:
PISA_r.describe()

          average  standard_error
count  496.000000      496.000000
mean   461.038690        2.789980
std     51.507665        1.143279
min    312.210000        0.300000
25%    420.912500        2.192500
50%    477.400000        2.730000
75%    499.312500        3.382500
max    556.020000        9.860000

In [30]:
PISA_sc.describe()

          average  standard_error
count  414.000000      414.000000
mean   465.391039        2.554614
std     52.028351        0.922299
min    331.640000        0.280000
25%    419.955000        2.060000
50%    480.010000        2.550000
75%    503.910000        3.070000
max    590.450000        6.110000

---

# Create new DataFrames, for each subject and year one DataFrame

In [31]:
years = ['2000', '2003', '2006', '2009', '2012', '2015', '2018', '2022']

# Create a new list to safe the new DataFrames
new_dataframes = []

# Iterate over every year
for year in years:
    # Filter the row for every DataFrame for each year
    PISA_m_year = PISA_m[PISA_m['year'] == year].copy()
    PISA_r_year = PISA_r[PISA_r['year'] == year].copy()
    PISA_sc_year = PISA_sc[PISA_sc['year'] == year].copy()
    
    # Add the new DataFrames to the list
    new_dataframes.extend([PISA_m_year, PISA_r_year, PISA_sc_year])

# Save the newly created DataFrames in new Variables
PISA_m_2000, PISA_r_2000, PISA_sc_2000 = new_dataframes[:3]
PISA_m_2003, PISA_r_2003, PISA_sc_2003 = new_dataframes[3:6]
PISA_m_2006, PISA_r_2006, PISA_sc_2006 = new_dataframes[6:9]
PISA_m_2009, PISA_r_2009, PISA_sc_2009 = new_dataframes[9:12]
PISA_m_2012, PISA_r_2012, PISA_sc_2012 = new_dataframes[12:15]
PISA_m_2015, PISA_r_2015, PISA_sc_2015 = new_dataframes[15:18]
PISA_m_2018, PISA_r_2018, PISA_sc_2018 = new_dataframes[18:21]
PISA_m_2022, PISA_r_2022, PISA_sc_2022 = new_dataframes[21:]

In [32]:
dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
              PISA_m_2003, PISA_r_2003, PISA_sc_2003,
              PISA_m_2006, PISA_r_2006, PISA_sc_2006,
              PISA_m_2009, PISA_r_2009, PISA_sc_2009,
              PISA_m_2012, PISA_r_2012, PISA_sc_2012,
              PISA_m_2015, PISA_r_2015, PISA_sc_2015,
              PISA_m_2018, PISA_r_2018, PISA_sc_2018,
              PISA_m_2022, PISA_r_2022, PISA_sc_2022]

for df in dataframes:
    df.reset_index(inplace=True, drop=True)

## Check that only one year is saved in each DataFrame

In [33]:
print(PISA_m_2000['year'].unique(), 
      PISA_m_2003['year'].unique(), 
      PISA_m_2006['year'].unique(), 
      PISA_m_2009['year'].unique(), 
      PISA_m_2012['year'].unique(), 
      PISA_m_2015['year'].unique(), 
      PISA_m_2018['year'].unique(), 
      PISA_m_2022['year'].unique())

['2000'] ['2003'] ['2006'] ['2009'] ['2012'] ['2015'] ['2018'] ['2022']

In [34]:
print(PISA_r_2000['year'].unique(),
    PISA_r_2003['year'].unique(),
    PISA_r_2006['year'].unique(),
    PISA_r_2009['year'].unique(),
    PISA_r_2012['year'].unique(),
    PISA_r_2015['year'].unique(),
    PISA_r_2018['year'].unique(),
    PISA_r_2022['year'].unique())

['2000'] ['2003'] ['2006'] ['2009'] ['2012'] ['2015'] ['2018'] ['2022']

In [35]:
print(PISA_sc_2000['year'].unique(),
    PISA_sc_2003['year'].unique(),
    PISA_sc_2006['year'].unique(),
    PISA_sc_2009['year'].unique(),
    PISA_sc_2012['year'].unique(),
    PISA_sc_2015['year'].unique(),
    PISA_sc_2018['year'].unique(),
    PISA_sc_2022['year'].unique())

['2000'] ['2003'] ['2006'] ['2009'] ['2012'] ['2015'] ['2018'] ['2022']

---

# Save the DataFrames (pisa_x)
## Export tables to database

In [36]:
sf.get_engine()

Engine(postgresql://user:***@host/database)

In [37]:
# dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
#               PISA_m_2003, PISA_r_2003, PISA_sc_2003,
#               PISA_m_2006, PISA_r_2006, PISA_sc_2006,
#               PISA_m_2009, PISA_r_2009, PISA_sc_2009,
#               PISA_m_2012, PISA_r_2012, PISA_sc_2012,
#               PISA_m_2015, PISA_r_2015, PISA_sc_2015,
#               PISA_m_2018, PISA_r_2018, PISA_sc_2018,
#               PISA_m_2022, PISA_r_2022, PISA_sc_2022]

# table_names = ['pisa_m_2000', 'pisa_r_2000', 'pisa_sc_2000',
#               'pisa_m_2003', 'pisa_r_2003', 'pisa_sc_2003',
#               'pisa_m_2006', 'pisa_r_2006', 'pisa_sc_2006',
#               'pisa_m_2009', 'pisa_r_2009', 'pisa_sc_2009',
#               'pisa_m_2012', 'pisa_r_2012', 'pisa_sc_2012',
#               'pisa_m_2015', 'pisa_r_2015', 'pisa_sc_2015',
#               'pisa_m_2018', 'pisa_r_2018', 'pisa_sc_2018',
#               'pisa_m_2022', 'pisa_r_2022', 'pisa_sc_2022']

# for df, table_name in zip(dataframes, table_names):
#     sf.push_to_cloud(df, table_name)

One can also create a dictionary to name the DataFrames - but pay attention: the DataFrame has to be the value and can't be the key!

In [38]:
test = {'name1': 'df1',
        'name2': 'df2',
        'name3': 'df3'}

for table_name, df in test.items():
    testi = f'{table_name}_pivot'
    print(df, testi)

df1 name1_pivot
df2 name2_pivot
df3 name3_pivot

In [39]:
# sf.push_to_cloud(PISA_m, 'pisa_m')
# sf.push_to_cloud(PISA_r, 'pisa_r')
# sf.push_to_cloud(PISA_sc, 'pisa_sc')

## Store DataFrames

In [40]:
pisa_m = PISA_m
pisa_r = PISA_r
pisa_sc = PISA_sc

%store pisa_m
%store pisa_r
%store pisa_sc

Stored 'pisa_m' (DataFrame)
Stored 'pisa_r' (DataFrame)
Stored 'pisa_sc' (DataFrame)

---

-- Extra Credit: Change the types for two columns and round the numbers (doppel gemoppelt - we did it at the beginning)

In [41]:
# dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
#               PISA_m_2003, PISA_r_2003, PISA_sc_2003,
#               PISA_m_2006, PISA_r_2006, PISA_sc_2006,
#               PISA_m_2009, PISA_r_2009, PISA_sc_2009,
#               PISA_m_2012, PISA_r_2012, PISA_sc_2012,
#               PISA_m_2015, PISA_r_2015, PISA_sc_2015,
#               PISA_m_2018, PISA_r_2018, PISA_sc_2018,
#               PISA_m_2022, PISA_r_2022, PISA_sc_2022]

# for df in dataframes:
#     df['average'] = df['average'].apply(pd.to_numeric, errors='coerce')
#     df['average'] = df['average'].round(2)

#     df['standard_error'] = df['standard_error'].apply(pd.to_numeric, errors='coerce')
#     df['standard_error'] = df['standard_error'].round(2)

Two other ways to do it:

In [42]:
# dataframes = [PISA_m_2000, PISA_r_2000, PISA_sc_2000,
#               PISA_m_2003, PISA_r_2003, PISA_sc_2003,
#               PISA_m_2006, PISA_r_2006, PISA_sc_2006,
#               PISA_m_2009, PISA_r_2009, PISA_sc_2009,
#               PISA_m_2012, PISA_r_2012, PISA_sc_2012,
#               PISA_m_2015, PISA_r_2015, PISA_sc_2015,
#               PISA_m_2018, PISA_r_2018, PISA_sc_2018,
#               PISA_m_2022, PISA_r_2022, PISA_sc_2022]

# for df in dataframes:
#     df['average'] = df['average'].astype(str).replace({'—': np.nan, '‡': np.nan, '†': np.nan})
#     df['average'] = df['average'].astype(float)
#     df['average'] = df['average'].round(2)

#     df['standard_error'] = df['standard_error'].astype(str).replace({'—': np.nan, '‡': np.nan, '†': np.nan})
#     df['standard_error'] = df['standard_error'].astype(float)
#     df['standard_error'] = df['standard_error'].round(2)

In [43]:
# df['average'] = df['average'].astype('str')
# df['average'] = df['average'].str.replace('-', '0')
# df['average'] = df['average'].astype

---
---

# Playground

In [44]:
PISA_m

     year                jurisdiction  average  standard_error
2    2022                   Australia   487.08            1.78
3    2022                     Austria   487.27            2.34
4    2022                     Belgium   489.49            2.20
5    2022                      Canada   496.95            1.56
6    2022                       Chile   411.70            2.08
..    ...                         ...      ...             ...
779  2000  Ukraine (18 of 27 Regions)      NaN             NaN
780  2000        United Arab Emirates      NaN             NaN
781  2000                     Uruguay      NaN             NaN
782  2000                  Uzbekistan      NaN             NaN
783  2000                    Viet Nam      NaN             NaN

[782 rows x 4 columns]

In [45]:
PISA_m['jurisdiction'].unique()

array(['Australia', 'Austria', 'Belgium', 'Canada', 'Chile', 'Colombia',
       'Costa Rica', 'Czech Republic', 'Denmark', 'Estonia', 'Finland',
       'France', 'Germany', 'Greece', 'Hungary', 'Iceland', 'Ireland',
       'Israel', 'Italy', 'Japan', 'Korea', 'Latvia', 'Lithuania',
       'Luxembourg', 'Mexico', 'Netherlands', 'New Zealand', 'Norway',
       'Poland', 'Portugal', 'Slovak Republic', 'Slovenia', 'Spain',
       'Sweden', 'Switzerland', 'Türkiye', 'United Kingdom',
       'United States', 'Albania', 'Albania (2015)', 'Algeria',
       'Argentina', 'Argentina (2015)', 'Baku (Azerbaijan)', 'Belarus',
       'Bosnia and Herzegovina', 'Brazil', 'Brunei Darussalam',
       'B-S-J-G (China)', 'B-S-J-Z (China)', 'Bulgaria', 'Cambodia',
       'Chinese Taipei', 'Croatia', 'Cyprus', 'Dominican Republic',
       'El Salvador', 'Georgia', 'Guatemala', 'Hong Kong (China)',
       'Indonesia', 'Jamaica', 'Jordan', 'Kazakhstan',
       'Kazakhstan (2015)', 'Kosovo', 'Lebanon', 'Macao (China)',
       'Malaysia', 'Malaysia (2015)', 'Malta', 'Moldova', 'Mongolia',
       'Montenegro', 'Morocco', 'North Macedonia',
       'Palestinian Authority', 'Panama', 'Paraguay', 'Peru',
       'Philippines', 'Qatar', 'Romania', 'Russia', 'Saudi Arabia',
       'Serbia', 'Singapore', 'Thailand', 'Trinidad and Tobago',
       'Tunisia', 'Ukraine', 'Ukraine (18 of 27 Regions)',
       'United Arab Emirates', 'Uruguay', 'Uzbekistan', 'Viet Nam',
       'Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

---
---

In [46]:
import python_functions_sp as pfsp

# Splitting the countries into the continents
- northern america
- southern america
- europe (4 parts for further analysis)
- africa
- asia
- pacific
- middle-east

Creating a copy with a meaningful name:

In [47]:
PISA_m_continents = PISA_m.copy()
PISA_r_continents = PISA_r.copy()
PISA_sc_continents = PISA_sc.copy()

In [48]:
PISA_m_continents.rename(columns={'jurisdiction': 'country'}, inplace=True)
PISA_r_continents.rename(columns={'jurisdiction': 'country'}, inplace=True)
PISA_sc_continents.rename(columns={'jurisdiction': 'country'}, inplace=True)

Check if it worked:

In [49]:
PISA_m_continents.head()

   year    country  average  standard_error
2  2022  Australia   487.08            1.78
3  2022    Austria   487.27            2.34
4  2022    Belgium   489.49            2.20
5  2022     Canada   496.95            1.56
6  2022      Chile   411.70            2.08

In [50]:
PISA_r_continents.head()

   year    country  average  standard_error
2  2022  Australia   498.05            2.01
3  2022    Austria   480.41            2.67
4  2022    Belgium   478.85            2.52
5  2022     Canada   507.13            1.97
6  2022      Chile   447.98            2.63

In [51]:
PISA_sc_continents.head()

   year    country  average  standard_error
2  2022  Australia   507.00            1.93
3  2022    Austria   491.27            2.65
4  2022    Belgium   490.58            2.48
5  2022     Canada   515.02            1.93
6  2022      Chile   443.54            2.47

Assigning the continent to the countries in a new created column:

In [52]:
PISA_m_continents['continent'] = PISA_m_continents['country'].apply(pfsp.assign_continent)
PISA_r_continents['continent'] = PISA_r_continents['country'].apply(pfsp.assign_continent)
PISA_sc_continents['continent'] = PISA_sc_continents['country'].apply(pfsp.assign_continent)

Assigning the four parts of europe to the countries in another new created column:

In [53]:
PISA_m_continents['continent_region'] = PISA_m_continents['country'].apply(pfsp.assign_europe_region)
PISA_r_continents['continent_region'] = PISA_r_continents['country'].apply(pfsp.assign_europe_region)
PISA_sc_continents['continent_region'] = PISA_sc_continents['country'].apply(pfsp.assign_europe_region)

Changing the order of the columns:

In [54]:
columns = ['country', 'continent', 'continent_region', 'year', 'average', 'standard_error']

PISA_m_continents = PISA_m_continents[columns]
PISA_r_continents = PISA_r_continents[columns]
PISA_sc_continents = PISA_sc_continents[columns]

Checking the result:

In [55]:
PISA_m_continents.sample(10)

,country,continent,continent_region,year,average,standard_error
169,Malaysia (2015),Pacific,Pacific,2018,NaN,NaN
579,Thailand,Asia,Asia,2006,417.07,2.34
782,Uzbekistan,Asia,Asia,2000,NaN,NaN
287,Tunisia,Africa,Africa,2015,366.82,2.95
689,Austria,Europe,West Europe,2000,NaN,NaN
208,Finland,Europe,North Europe,2015,511.08,2.31
266,Malaysia,Pacific,Pacific,2015,NaN,NaN
687,International Average (OECD),Other,Other,2000,NaN,NaN
234,United Kingdom,Europe,North Europe,2015,492.48,2.50
521,Portugal,Europe,South Europe,2006,466.16,3.07

In [56]:
PISA_r_continents.sample(10)

,country,continent,continent_region,year,average,standard_error
486,United Arab Emirates,Middle East,Middle East,2009,NaN,NaN
681,Ukraine (18 of 27 Regions),Europe,East Europe,2003,NaN,NaN
238,Algeria,Africa,Africa,2015,349.86,3.00
70,Malaysia,Pacific,Pacific,2022,388.09,2.75
81,Peru,South America,South America,2022,408.25,2.73
418,Mexico,South America,South America,2009,425.27,1.95
243,Bosnia and Herzegovina,Europe,South Europe,2015,NaN,NaN
441,Brunei Darussalam,Middle East,Middle East,2009,NaN,NaN
160,Indonesia,Pacific,Pacific,2018,370.97,2.56
543,Cambodia,Pacific,Pacific,2006,NaN,NaN

In [57]:
PISA_sc_continents.sample(10)

,country,continent,continent_region,year,average,standard_error
157,Georgia,Asia,Asia,2018,382.66,2.31
487,Uruguay,South America,South America,2009,427.21,2.57
144,Belarus,Europe,East Europe,2018,471.26,2.45
343,Brunei Darussalam,Middle East,Middle East,2012,NaN,NaN
335,Albania (2015),Europe,South Europe,2012,NaN,NaN
117,Israel,Asia,Asia,2018,462.20,3.62
731,Baku (Azerbaijan),Asia,Asia,2000,NaN,NaN
586,Uzbekistan,Asia,Asia,2006,NaN,NaN
639,B-S-J-Z (China),Pacific,Pacific,2003,NaN,NaN
342,Brazil,South America,South America,2012,401.62,2.06

Check if some countries couldn't be assigned to a continent:

In [58]:
PISA_m_continents[PISA_m_continents['continent'] == 'Other']['country'].unique()

array(['Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

In [59]:
PISA_m_continents[PISA_m_continents['continent_region'] == 'Other']['country'].unique()

array(['Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

In [60]:
PISA_r_continents[PISA_r_continents['continent'] == 'Other']['country'].unique()

array(['Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

In [61]:
PISA_r_continents[PISA_r_continents['continent_region'] == 'Other']['country'].unique()

array(['Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

In [62]:
PISA_sc_continents[PISA_sc_continents['continent'] == 'Other']['country'].unique()

array(['Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

In [63]:
PISA_sc_continents[PISA_sc_continents['continent_region'] == 'Other']['country'].unique()

array(['Selected countries and jurisdictions',
       'International Average (OECD)'], dtype=object)

---

Check if the new created columns match:

In [64]:
pfsp.check_values(PISA_m_continents)
pfsp.check_values(PISA_r_continents)
pfsp.check_values(PISA_sc_continents)

All values match.
All values match.
All values match.

---

# Saving pisa_x_continents

## Export tables to database

In [65]:
# sf.push_to_cloud(PISA_m_continents, 'pisa_m_continents')
# sf.push_to_cloud(PISA_r_continents, 'pisa_r_continents')
# sf.push_to_cloud(PISA_sc_continents, 'pisa_sc_continents')

## Storing the DataFrames

In [66]:
pisa_m_continents = PISA_m_continents
pisa_r_continents = PISA_r_continents
pisa_sc_continents = PISA_sc_continents

%store pisa_m_continents
%store pisa_r_continents
%store pisa_sc_continents

Stored 'pisa_m_continents' (DataFrame)
Stored 'pisa_r_continents' (DataFrame)
Stored 'pisa_sc_continents' (DataFrame)

---
---

In [67]:
PISA_m_continents.sample(10)

,country,continent,continent_region,year,average,standard_error
679,Tunisia,Africa,Africa,2003,358.73,2.54
179,Peru,South America,South America,2018,399.84,2.61
630,Algeria,Africa,Africa,2003,NaN,NaN
289,Ukraine (18 of 27 Regions),Europe,East Europe,2015,NaN,NaN
771,Russia,Europe,East Europe,2000,NaN,NaN
550,Guatemala,South America,South America,2006,NaN,NaN
654,Kazakhstan (2015),Asia,Asia,2003,NaN,NaN
461,Macao (China),Pacific,Pacific,2009,525.28,0.92
714,New Zealand,Pacific,Pacific,2000,NaN,NaN
136,United Kingdom,Europe,North Europe,2018,501.77,2.56

In [68]:
PISA_r_continents.sample(10)

,country,continent,continent_region,year,average,standard_error
523,Slovenia,Europe,South Europe,2006,494.41,0.99
407,Greece,Europe,South Europe,2009,482.78,4.32
216,Italy,Europe,South Europe,2015,484.76,2.68
260,Jordan,Asia,Asia,2015,408.10,2.93
752,Kazakhstan (2015),Asia,Asia,2000,NaN,NaN
644,Cyprus,Europe,South Europe,2003,NaN,NaN
190,Ukraine,Europe,East Europe,2018,465.95,3.50
129,Portugal,Europe,South Europe,2018,491.80,2.43
62,Indonesia,Pacific,Pacific,2022,358.57,2.91
331,Türkiye,Asia,Asia,2012,475.49,4.21

In [69]:
PISA_sc_continents.sample(10)

,country,continent,continent_region,year,average,standard_error
626,United Kingdom,Europe,North Europe,2003,NaN,NaN
640,Bulgaria,Europe,East Europe,2003,NaN,NaN
52,Bulgaria,Europe,East Europe,2022,420.99,3.17
125,Netherlands,Europe,West Europe,2018,503.38,2.84
228,Slovak Republic,Europe,East Europe,2015,460.77,2.59
139,Albania (2015),Europe,South Europe,2018,NaN,NaN
296,Australia,Pacific,Pacific,2012,521.49,1.76
301,Colombia,South America,South America,2012,398.68,3.05
691,Canada,North America,North America,2000,NaN,NaN
117,Israel,Asia,Asia,2018,462.20,3.62